src/InformationRegisters/ксСоединения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ксСоединения</Name>
			<Comment>DEV-12001</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>connId</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>host</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>process</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>infobase</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>application</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>connectedAt</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>sessionNumber</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>blockedByLs</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ПериодЗаписи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>connection</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Кластер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/ксСоединения/Ext/ManagerModule.bsl
Процедура ЗаписатьСоединения(ТаблицаСеансов, Кластер, ПериодЗаписи) Экспорт
	
	Для каждого ТекСтрока из ТаблицаСеансов Цикл
		Если ЗначениеЗаполнено(ТекСтрока.connection) Тогда
			МЗ = РегистрыСведений.ксСоединения.СоздатьМенеджерЗаписи();
			ЗаполнитьЗначенияСвойств(МЗ,ТекСтрока); 
			МЗ.connection = Новый УникальныйИдентификатор(ТекСтрока.connection);
			МЗ.infobase = Новый УникальныйИдентификатор(ТекСтрока.infobase);
			МЗ.process = Новый УникальныйИдентификатор(ТекСтрока.process);		
			Если ТекСтрока.application = "1CV8C" Тогда
				МЗ.application = "Тонкий клиент";
			ИначеЕсли  ТекСтрока.application = "BackgroundJob" Тогда
				МЗ.application = "Фоновое задание"; 
			ИначеЕсли ТекСтрока.application = "WebClient" Тогда
				МЗ.application = "Веб-клиент";
			ИначеЕсли ТекСтрока.application = "HTTPServiceConnection" Тогда
				МЗ.application = "Соединение с HTTP-сервисом";
			ИначеЕсли ТекСтрока.application = "SrvrConsole" Тогда
				МЗ.application = "Консоль кластера"; 				 
			ИначеЕсли ТекСтрока.application = "Designer" Тогда
				МЗ.application = "Конфигуратор";  
			ИначеЕсли ТекСтрока.application = "1CV8" Тогда
				МЗ.application = "Толстый клиент";
			КонецЕсли;
	        МЗ.connectedAt = xmlЗначение(тип("дата"), ТекСтрока.connectedAt);
			МЗ.Кластер = Кластер;
			МЗ.ПериодЗаписи = ПериодЗаписи;
			МЗ.Записать();	
		КонецЕсли;
	КонецЦикла;	
	
КонецПроцедуры
